betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
/**
  *
  * @file    apm32f4xx_dal_rcm.h
  * @brief   Header file of RCM DAL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DAL_RCM_H
#define APM32F4xx_DAL_RCM_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal_def.h"

/* Include RCM DAL Extended module */
/* (include on top of file since RCM structures are defined in extended file) */
#include "apm32f4xx_dal_rcm_ex.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @addtogroup RCM
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCM_Exported_Types RCM Exported Types
  * @{
  */

/**
  * @brief  RCM Internal/External Oscillator (HSE, HSI, LSE and LSI) configuration structure definition
  */
typedef struct
{
  uint32_t OscillatorType;       /*!< The oscillators to be configured.
                                      This parameter can be a value of @ref RCM_Oscillator_Type                   */

  uint32_t HSEState;             /*!< The new state of the HSE.
                                      This parameter can be a value of @ref RCM_HSE_Config                        */

#if defined(APM32F403xx) || defined(APM32F402xx)
  uint32_t HSEPredivValue;       /*!<  The Prediv1 factor value (named PREDIV1 or PLLXTPRE in RM)
                                       This parameter can be a value of @ref RCMEx_Prediv1_Factor                 */
#endif /* APM32F403xx || APM32F402xx */

  uint32_t LSEState;             /*!< The new state of the LSE.
                                      This parameter can be a value of @ref RCM_LSE_Config                        */

  uint32_t HSIState;             /*!< The new state of the HSI.
                                      This parameter can be a value of @ref RCM_HSI_Config                        */

  uint32_t HSICalibrationValue;  /*!< The HSI calibration trimming value (default is RCM_HSICALIBRATION_DEFAULT).
                                       This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x1F */

  uint32_t LSIState;             /*!< The new state of the LSI.
                                      This parameter can be a value of @ref RCM_LSI_Config                        */

  RCM_PLLInitTypeDef PLL;        /*!< PLL structure parameters                                                    */
}RCM_OscInitTypeDef;

/**
  * @brief  RCM System, AHB and APB busses clock configuration structure definition
  */
typedef struct
{
  uint32_t ClockType;             /*!< The clock to be configured.
                                       This parameter can be a value of @ref RCM_System_Clock_Type      */

  uint32_t SYSCLKSource;          /*!< The clock source (SYSCLKS) used as system clock.
                                       This parameter can be a value of @ref RCM_System_Clock_Source    */

  uint32_t AHBCLKDivider;         /*!< The AHB clock (HCLK) divider. This clock is derived from the system clock (SYSCLK).
                                       This parameter can be a value of @ref RCM_AHB_Clock_Source       */

  uint32_t APB1CLKDivider;        /*!< The APB1 clock (PCLK1) divider. This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCM_APB1_APB2_Clock_Source */

  uint32_t APB2CLKDivider;        /*!< The APB2 clock (PCLK2) divider. This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCM_APB1_APB2_Clock_Source */

}RCM_ClkInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCM_Exported_Constants RCM Exported Constants
  * @{
  */

/** @defgroup RCM_Oscillator_Type Oscillator Type
  * @{
  */
#define RCM_OSCILLATORTYPE_NONE            0x00000000U
#define RCM_OSCILLATORTYPE_HSE             0x00000001U
#define RCM_OSCILLATORTYPE_HSI             0x00000002U
#define RCM_OSCILLATORTYPE_LSE             0x00000004U
#define RCM_OSCILLATORTYPE_LSI             0x00000008U
/**
  * @}
  */

/** @defgroup RCM_HSE_Config HSE Config
  * @{
  */
#define RCM_HSE_OFF                      0x00000000U
#define RCM_HSE_ON                       RCM_CTRL_HSEEN
#define RCM_HSE_BYPASS                   ((uint32_t)(RCM_CTRL_HSEBCFG | RCM_CTRL_HSEEN))
/**
  * @}
  */

/** @defgroup RCM_LSE_Config LSE Config
  * @{
  */
#define RCM_LSE_OFF                    0x00000000U
#define RCM_LSE_ON                     RCM_BDCTRL_LSEEN
#define RCM_LSE_BYPASS                 ((uint32_t)(RCM_BDCTRL_LSEBCFG | RCM_BDCTRL_LSEEN))
/**
  * @}
  */

/** @defgroup RCM_HSI_Config HSI Config
  * @{
  */
#define RCM_HSI_OFF                      ((uint8_t)0x00)
#define RCM_HSI_ON                       ((uint8_t)0x01)

