betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
#define RCM_HSICALIBRATION_DEFAULT       0x10U         /* Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCM_LSI_Config LSI Config
  * @{
  */
#define RCM_LSI_OFF                      ((uint8_t)0x00)
#define RCM_LSI_ON                       ((uint8_t)0x01)
/**
  * @}
  */

/** @defgroup RCM_PLL_Config PLL Config
  * @{
  */
#define RCM_PLL_NONE                      ((uint8_t)0x00)
#define RCM_PLL_OFF                       ((uint8_t)0x01)
#define RCM_PLL_ON                        ((uint8_t)0x02)
/**
  * @}
  */

/** @defgroup RCM_PLL1C_Clock_Divider PLL1C Clock Divider
  * @{
  */
#define RCM_PLL1C_DIV2                  0x00000002U
#define RCM_PLL1C_DIV4                  0x00000004U
#define RCM_PLL1C_DIV6                  0x00000006U
#define RCM_PLL1C_DIV8                  0x00000008U
/**
  * @}
  */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup RCM_PLL_Clock_Source PLL Clock Source
  * @{
  */
#define RCM_PLLSOURCE_HSI                RCM_PLL1CFG_PLL1CLKS_HSI
#define RCM_PLLSOURCE_HSE                RCM_PLL1CFG_PLL1CLKS_HSE
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/** @defgroup RCM_System_Clock_Type System Clock Type
  * @{
  */
#define RCM_CLOCKTYPE_SYSCLK             0x00000001U
#define RCM_CLOCKTYPE_HCLK               0x00000002U
#define RCM_CLOCKTYPE_PCLK1              0x00000004U
#define RCM_CLOCKTYPE_PCLK2              0x00000008U
/**
  * @}
  */

/** @defgroup RCM_System_Clock_Source System Clock Source
  * @{
  */
#define RCM_SYSCLKSOURCE_HSI             RCM_CFG_SCLKSEL_HSI
#define RCM_SYSCLKSOURCE_HSE             RCM_CFG_SCLKSEL_HSE
#define RCM_SYSCLKSOURCE_PLLCLK          RCM_CFG_SCLKSEL_PLL
/**
  * @}
  */

/** @defgroup RCM_System_Clock_Source_Status System Clock Source Status
  * @{
  */
#define RCM_SYSCLKSOURCE_STATUS_HSI     RCM_CFG_SCLKSELSTS_HSI   /*!< HSI used as system clock */
#define RCM_SYSCLKSOURCE_STATUS_HSE     RCM_CFG_SCLKSELSTS_HSE   /*!< HSE used as system clock */
#define RCM_SYSCLKSOURCE_STATUS_PLLCLK  RCM_CFG_SCLKSELSTS_PLL   /*!< PLL used as system clock */
/**
  * @}
  */

/** @defgroup RCM_AHB_Clock_Source AHB Clock Source
  * @{
  */
#define RCM_SYSCLK_DIV1                  RCM_CFG_AHBPSC_DIV1
#define RCM_SYSCLK_DIV2                  RCM_CFG_AHBPSC_DIV2
#define RCM_SYSCLK_DIV4                  RCM_CFG_AHBPSC_DIV4
#define RCM_SYSCLK_DIV8                  RCM_CFG_AHBPSC_DIV8
#define RCM_SYSCLK_DIV16                 RCM_CFG_AHBPSC_DIV16
#define RCM_SYSCLK_DIV64                 RCM_CFG_AHBPSC_DIV64
#define RCM_SYSCLK_DIV128                RCM_CFG_AHBPSC_DIV128
#define RCM_SYSCLK_DIV256                RCM_CFG_AHBPSC_DIV256
#define RCM_SYSCLK_DIV512                RCM_CFG_AHBPSC_DIV512
/**
  * @}
  */

/** @defgroup RCM_APB1_APB2_Clock_Source APB1/APB2 Clock Source
  * @{
  */
#define RCM_HCLK_DIV1                    RCM_CFG_APB1PSC_DIV1
#define RCM_HCLK_DIV2                    RCM_CFG_APB1PSC_DIV2
#define RCM_HCLK_DIV4                    RCM_CFG_APB1PSC_DIV4
#define RCM_HCLK_DIV8                    RCM_CFG_APB1PSC_DIV8
#define RCM_HCLK_DIV16                   RCM_CFG_APB1PSC_DIV16
/**
  * @}
  */

/** @defgroup RCM_RTC_Clock_Source RTC Clock Source
  * @{
  */
#define RCM_RTCCLKSOURCE_NO_CLK          0x00000000U
#define RCM_RTCCLKSOURCE_LSE             0x00000100U
#define RCM_RTCCLKSOURCE_LSI             0x00000200U
#if defined(APM32F403xx) || defined(APM32F402xx)
#define RCM_RTCCLKSOURCE_HSE_DIV128      0x00000300U
#else
#define RCM_RTCCLKSOURCE_HSE_DIVX        0x00000300U
#define RCM_RTCCLKSOURCE_HSE_DIV2        0x00020300U
#define RCM_RTCCLKSOURCE_HSE_DIV3        0x00030300U
#define RCM_RTCCLKSOURCE_HSE_DIV4        0x00040300U
#define RCM_RTCCLKSOURCE_HSE_DIV5        0x00050300U
#define RCM_RTCCLKSOURCE_HSE_DIV6        0x00060300U
#define RCM_RTCCLKSOURCE_HSE_DIV7        0x00070300U
#define RCM_RTCCLKSOURCE_HSE_DIV8        0x00080300U
#define RCM_RTCCLKSOURCE_HSE_DIV9        0x00090300U
#define RCM_RTCCLKSOURCE_HSE_DIV10       0x000A0300U
#define RCM_RTCCLKSOURCE_HSE_DIV11       0x000B0300U
#define RCM_RTCCLKSOURCE_HSE_DIV12       0x000C0300U
#define RCM_RTCCLKSOURCE_HSE_DIV13       0x000D0300U
#define RCM_RTCCLKSOURCE_HSE_DIV14       0x000E0300U
#define RCM_RTCCLKSOURCE_HSE_DIV15       0x000F0300U
#define RCM_RTCCLKSOURCE_HSE_DIV16       0x00100300U
#define RCM_RTCCLKSOURCE_HSE_DIV17       0x00110300U
#define RCM_RTCCLKSOURCE_HSE_DIV18       0x00120300U
#define RCM_RTCCLKSOURCE_HSE_DIV19       0x00130300U
#define RCM_RTCCLKSOURCE_HSE_DIV20       0x00140300U
#define RCM_RTCCLKSOURCE_HSE_DIV21       0x00150300U
#define RCM_RTCCLKSOURCE_HSE_DIV22       0x00160300U
#define RCM_RTCCLKSOURCE_HSE_DIV23       0x00170300U
#define RCM_RTCCLKSOURCE_HSE_DIV24       0x00180300U
#define RCM_RTCCLKSOURCE_HSE_DIV25       0x00190300U
#define RCM_RTCCLKSOURCE_HSE_DIV26       0x001A0300U
#define RCM_RTCCLKSOURCE_HSE_DIV27       0x001B0300U
#define RCM_RTCCLKSOURCE_HSE_DIV28       0x001C0300U
#define RCM_RTCCLKSOURCE_HSE_DIV29       0x001D0300U
#define RCM_RTCCLKSOURCE_HSE_DIV30       0x001E0300U
#define RCM_RTCCLKSOURCE_HSE_DIV31       0x001F0300U
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup RCM_MCO_Index MCO Index
  * @{
  */
#define RCM_MCO1                         0x00000000U
#define RCM_MCO2                         0x00000001U
/**
  * @}
  */

/** @defgroup RCM_MCO1_Clock_Source MCO1 Clock Source
  * @{
  */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define RCM_MCO1SOURCE_NOCLOCK           RCM_CFG_MCOSEL_NOCLOCK
#define RCM_MCO1SOURCE_SYSCLK            RCM_CFG_MCOSEL_SYSCLK
#define RCM_MCO1SOURCE_HSI               RCM_CFG_MCOSEL_HSI
#define RCM_MCO1SOURCE_HSE               RCM_CFG_MCOSEL_HSE
#define RCM_MCO1SOURCE_PLLCLK            RCM_CFG_MCOSEL_PLLCLK_DIV2
#else
#define RCM_MCO1SOURCE_HSI               0x00000000U
#define RCM_MCO1SOURCE_LSE               RCM_CFG_MCO1SEL_0
#define RCM_MCO1SOURCE_HSE               RCM_CFG_MCO1SEL_1
#define RCM_MCO1SOURCE_PLLCLK            RCM_CFG_MCO1SEL
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

