betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
/** @defgroup RCM_MCOx_Clock_Prescaler MCOx Clock Prescaler
  * @{
  */
#define RCM_MCODIV_1                    0x00000000U
#define RCM_MCODIV_2                    RCM_CFG_MCO1PSC_2
#define RCM_MCODIV_3                    ((uint32_t)RCM_CFG_MCO1PSC_0 | RCM_CFG_MCO1PSC_2)
#define RCM_MCODIV_4                    ((uint32_t)RCM_CFG_MCO1PSC_1 | RCM_CFG_MCO1PSC_2)
#define RCM_MCODIV_5                    RCM_CFG_MCO1PSC
/**
  * @}
  */

/** @defgroup RCM_Interrupt Interrupts
  * @{
  */
#define RCM_IT_LSIRDY                    ((uint8_t)0x01)
#define RCM_IT_LSERDY                    ((uint8_t)0x02)
#define RCM_IT_HSIRDY                    ((uint8_t)0x04)
#define RCM_IT_HSERDY                    ((uint8_t)0x08)
#define RCM_IT_PLLRDY                    ((uint8_t)0x10)
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx)
#define RCM_IT_PLL2RDY                   ((uint8_t)0x20)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */
#define RCM_IT_CSS                       ((uint8_t)0x80)
/**
  * @}
  */

/** @defgroup RCM_Flag Flags
  *        Elements values convention: 0XXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - 0XX  : Register index
  *                 - 01: CTRL register
  *                 - 10: BDCTRL register
  *                 - 11: CSTS register
  * @{
  */
/* Flags in the CTRL register */
#define RCM_FLAG_HSIRDY                  ((uint8_t)0x21)
#define RCM_FLAG_HSERDY                  ((uint8_t)0x31)
#define RCM_FLAG_PLLRDY                  ((uint8_t)0x39)
#define RCM_FLAG_PLL2RDY                 ((uint8_t)0x3B)

/* Flags in the BDCTRL register */
#define RCM_FLAG_LSERDY                  ((uint8_t)0x41)

/* Flags in the CSTS register */
#define RCM_FLAG_LSIRDY                  ((uint8_t)0x61)
#define RCM_FLAG_BORRST                  ((uint8_t)0x79)
#define RCM_FLAG_PINRST                  ((uint8_t)0x7A)
#define RCM_FLAG_PORRST                  ((uint8_t)0x7B)
#define RCM_FLAG_SFTRST                  ((uint8_t)0x7C)
#define RCM_FLAG_IWDTRST                 ((uint8_t)0x7D)
#define RCM_FLAG_WWDTRST                 ((uint8_t)0x7E)
#define RCM_FLAG_LPWRRST                 ((uint8_t)0x7F)
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCM_Exported_Macros RCM Exported Macros
  * @{
  */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup RCM_AHB1_Clock_Enable_Disable AHB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_GPIOA_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PAEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PAEN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_GPIOB_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PBEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PBEN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_GPIOC_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PCEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PCEN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_GPIOH_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PHEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PHEN);\
                                        UNUSED(tmpreg); \
                                         } while(0U)
#define __DAL_RCM_DMA1_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DMA1EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DMA1EN);\
                                        UNUSED(tmpreg); \
                                         } while(0U)
#define __DAL_RCM_DMA2_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DMA2EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DMA2EN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)

#define __DAL_RCM_GPIOA_CLK_DISABLE()        (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PAEN))
#define __DAL_RCM_GPIOB_CLK_DISABLE()        (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PBEN))
#define __DAL_RCM_GPIOC_CLK_DISABLE()        (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PCEN))
#define __DAL_RCM_GPIOH_CLK_DISABLE()        (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PHEN))
#define __DAL_RCM_DMA1_CLK_DISABLE()         (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_DMA1EN))
#define __DAL_RCM_DMA2_CLK_DISABLE()         (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_DMA2EN))
/**
  * @}
  */

