betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
/** @defgroup RCM_AHB1_Peripheral_Clock_Enable_Disable_Status AHB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_GPIOA_IS_CLK_ENABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_PAEN)) != RESET)
#define __DAL_RCM_GPIOB_IS_CLK_ENABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_PBEN)) != RESET)
#define __DAL_RCM_GPIOC_IS_CLK_ENABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_PCEN)) != RESET)
#define __DAL_RCM_GPIOH_IS_CLK_ENABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_PHEN)) != RESET)
#define __DAL_RCM_DMA1_IS_CLK_ENABLED()         ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_DMA1EN)) != RESET)
#define __DAL_RCM_DMA2_IS_CLK_ENABLED()         ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_DMA2EN)) != RESET)

#define __DAL_RCM_GPIOA_IS_CLK_DISABLED()       ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_PAEN)) == RESET)
#define __DAL_RCM_GPIOB_IS_CLK_DISABLED()       ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_PBEN)) == RESET)
#define __DAL_RCM_GPIOC_IS_CLK_DISABLED()       ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_PCEN)) == RESET)
#define __DAL_RCM_GPIOH_IS_CLK_DISABLED()       ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_PHEN)) == RESET)
#define __DAL_RCM_DMA1_IS_CLK_DISABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_DMA1EN)) == RESET)
#define __DAL_RCM_DMA2_IS_CLK_DISABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_DMA2EN)) == RESET)
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/** @defgroup RCM_APB1_Clock_Enable_Disable APB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the Low Speed APB (APB1) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR5_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR5EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR5EN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_WWDT_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_WWDTEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_WWDTEN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_SPI2_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_SPI2EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_SPI2EN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_USART2_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_USART2EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_USART2EN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_I2C1_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_I2C1EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_I2C1EN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_PMU_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_PMUEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_PMUEN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)

#define __DAL_RCM_TMR5_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR5EN))
#define __DAL_RCM_WWDT_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_WWDTEN))
#define __DAL_RCM_SPI2_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_SPI2EN))
#define __DAL_RCM_USART2_CLK_DISABLE() (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_USART2EN))
#define __DAL_RCM_I2C1_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_I2C1EN))
#define __DAL_RCM_PMU_CLK_DISABLE()    (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_PMUEN))

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_I2C2_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_I2C2EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_I2C2EN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)
#define __DAL_RCM_I2C2_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_I2C2EN))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @}
  */

/** @defgroup RCM_APB1_Peripheral_Clock_Enable_Disable_Status APB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR5_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR5EN)) != RESET)
#define __DAL_RCM_WWDT_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_WWDTEN)) != RESET)
#define __DAL_RCM_SPI2_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_SPI2EN)) != RESET)
#define __DAL_RCM_USART2_IS_CLK_ENABLED() ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USART2EN)) != RESET)
#define __DAL_RCM_I2C1_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_I2C1EN)) != RESET)
#define __DAL_RCM_PMU_IS_CLK_ENABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_PMUEN)) != RESET)

#define __DAL_RCM_TMR5_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR5EN)) == RESET)
#define __DAL_RCM_WWDT_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_WWDTEN)) == RESET)
#define __DAL_RCM_SPI2_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_SPI2EN)) == RESET)
#define __DAL_RCM_USART2_IS_CLK_DISABLED() ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USART2EN)) == RESET)
#define __DAL_RCM_I2C1_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_I2C1EN)) == RESET)
#define __DAL_RCM_PMU_IS_CLK_DISABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_PMUEN)) == RESET)

