betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
#define __DAL_RCM_TMR1_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR1EN)) == RESET)
#define __DAL_RCM_USART1_IS_CLK_DISABLED() ((RCM->APB2CLKEN & (RCM_APB2CLKEN_USART1EN)) == RESET)
#define __DAL_RCM_ADC1_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC1EN)) == RESET)
#define __DAL_RCM_SPI1_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SPI1EN)) == RESET)

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USART6_IS_CLK_ENABLED() ((RCM->APB2CLKEN & (RCM_APB2CLKEN_USART6EN)) != RESET)
#define __DAL_RCM_SYSCFG_IS_CLK_ENABLED() ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SYSCFGEN)) != RESET)
#define __DAL_RCM_TMR9_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR9EN)) != RESET)
#define __DAL_RCM_TMR11_IS_CLK_ENABLED()  ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR11EN)) != RESET)

#define __DAL_RCM_USART6_IS_CLK_DISABLED() ((RCM->APB2CLKEN & (RCM_APB2CLKEN_USART6EN)) == RESET)
#define __DAL_RCM_SYSCFG_IS_CLK_DISABLED() ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SYSCFGEN)) == RESET)
#define __DAL_RCM_TMR9_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR9EN)) == RESET)
#define __DAL_RCM_TMR11_IS_CLK_DISABLED()  ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR11EN)) == RESET)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCM_AHB1_Force_Release_Reset AHB1 Force Release Reset
  * @brief  Force or release AHB1 peripheral reset.
  * @{
  */
#define __DAL_RCM_AHB1_FORCE_RESET()    (RCM->AHB1RST = 0xFFFFFFFFU)

#define __DAL_RCM_AHB1_RELEASE_RESET()  (RCM->AHB1RST = 0x00U)

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_GPIOA_FORCE_RESET()   (RCM->AHB1RST |= (RCM_AHB1RST_PARST))
#define __DAL_RCM_GPIOB_FORCE_RESET()   (RCM->AHB1RST |= (RCM_AHB1RST_PBRST))
#define __DAL_RCM_GPIOC_FORCE_RESET()   (RCM->AHB1RST |= (RCM_AHB1RST_PCRST))
#define __DAL_RCM_GPIOH_FORCE_RESET()   (RCM->AHB1RST |= (RCM_AHB1RST_PHRST))
#define __DAL_RCM_DMA1_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_DMA1RST))
#define __DAL_RCM_DMA2_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_DMA2RST))

#define __DAL_RCM_GPIOA_RELEASE_RESET() (RCM->AHB1RST &= ~(RCM_AHB1RST_PARST))
#define __DAL_RCM_GPIOB_RELEASE_RESET() (RCM->AHB1RST &= ~(RCM_AHB1RST_PBRST))
#define __DAL_RCM_GPIOC_RELEASE_RESET() (RCM->AHB1RST &= ~(RCM_AHB1RST_PCRST))
#define __DAL_RCM_GPIOH_RELEASE_RESET() (RCM->AHB1RST &= ~(RCM_AHB1RST_PHRST))
#define __DAL_RCM_DMA1_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_DMA1RST))
#define __DAL_RCM_DMA2_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_DMA2RST))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCM_APB1_Force_Release_Reset APB1 Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#define __DAL_RCM_APB1_FORCE_RESET()     (RCM->APB1RST = 0xFFFFFFFFU)
#define __DAL_RCM_TMR5_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR5RST))
#define __DAL_RCM_WWDT_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_WWDTRST))
#define __DAL_RCM_SPI2_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_SPI2RST))
#define __DAL_RCM_USART2_FORCE_RESET()   (RCM->APB1RST |= (RCM_APB1RST_USART2RST))
#define __DAL_RCM_I2C1_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_I2C1RST))
#define __DAL_RCM_PMU_FORCE_RESET()      (RCM->APB1RST |= (RCM_APB1RST_PMURST))

#define __DAL_RCM_APB1_RELEASE_RESET()   (RCM->APB1RST = 0x00U)
#define __DAL_RCM_TMR5_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR5RST))
#define __DAL_RCM_WWDT_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_WWDTRST))
#define __DAL_RCM_SPI2_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_SPI2RST))
#define __DAL_RCM_USART2_RELEASE_RESET() (RCM->APB1RST &= ~(RCM_APB1RST_USART2RST))
#define __DAL_RCM_I2C1_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_I2C1RST))
#define __DAL_RCM_PMU_RELEASE_RESET()    (RCM->APB1RST &= ~(RCM_APB1RST_PMURST))

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_I2C2_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_I2C2RST))
#define __DAL_RCM_I2C2_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_I2C2RST))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCM_APB2_Force_Release_Reset APB2 Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __DAL_RCM_APB2_FORCE_RESET()     (RCM->APB2RST = 0xFFFFFFFFU)
#define __DAL_RCM_TMR1_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_TMR1RST))
#define __DAL_RCM_USART1_FORCE_RESET()   (RCM->APB2RST |= (RCM_APB2RST_USART1RST))
#define __DAL_RCM_SPI1_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_SPI1RST))

#define __DAL_RCM_APB2_RELEASE_RESET()   (RCM->APB2RST = 0x00U)
#define __DAL_RCM_TMR1_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_TMR1RST))
#define __DAL_RCM_USART1_RELEASE_RESET() (RCM->APB2RST &= ~(RCM_APB2RST_USART1RST))
#define __DAL_RCM_SPI1_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_SPI1RST))

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USART6_FORCE_RESET()   (RCM->APB2RST |= (RCM_APB2RST_USART6RST))
#define __DAL_RCM_ADC_FORCE_RESET()      (RCM->APB2RST |= (RCM_APB2RST_ADCRST))
#define __DAL_RCM_SYSCFG_FORCE_RESET()   (RCM->APB2RST |= (RCM_APB2RST_SYSCFGRST))
#define __DAL_RCM_TMR9_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_TMR9RST))
#define __DAL_RCM_TMR11_FORCE_RESET()    (RCM->APB2RST |= (RCM_APB2RST_TMR11RST))

