betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
#define __DAL_RCM_USART6_RELEASE_RESET() (RCM->APB2RST &= ~(RCM_APB2RST_USART6RST))
#define __DAL_RCM_ADC_RELEASE_RESET()    (RCM->APB2RST &= ~(RCM_APB2RST_ADCRST))
#define __DAL_RCM_SYSCFG_RELEASE_RESET() (RCM->APB2RST &= ~(RCM_APB2RST_SYSCFGRST))
#define __DAL_RCM_TMR9_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_TMR9RST))
#define __DAL_RCM_TMR11_RELEASE_RESET()  (RCM->APB2RST &= ~(RCM_APB2RST_TMR11RST))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup RCM_AHB1_LowPower_Enable_Disable AHB1 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wake-up from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_GPIOA_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PALPEN))
#define __DAL_RCM_GPIOB_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PBLPEN))
#define __DAL_RCM_GPIOC_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PCLPEN))
#define __DAL_RCM_GPIOH_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PHLPEN))
#define __DAL_RCM_DMA1_CLK_SLEEP_ENABLE()     (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_DMA1EN))
#define __DAL_RCM_DMA2_CLK_SLEEP_ENABLE()     (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_DMA2EN))

#define __DAL_RCM_GPIOA_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PALPEN))
#define __DAL_RCM_GPIOB_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PBLPEN))
#define __DAL_RCM_GPIOC_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PCLPEN))
#define __DAL_RCM_GPIOH_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PHLPEN))
#define __DAL_RCM_DMA1_CLK_SLEEP_DISABLE()    (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_DMA1EN))
#define __DAL_RCM_DMA2_CLK_SLEEP_DISABLE()    (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_DMA2EN))
/**
  * @}
  */

/** @defgroup RCM_APB1_LowPower_Enable_Disable APB1 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wake-up from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_TMR5_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR5EN))
#define __DAL_RCM_WWDT_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_WWDTEN))
#define __DAL_RCM_SPI2_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_SPI2EN))
#define __DAL_RCM_USART2_CLK_SLEEP_ENABLE()  (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_USART2EN))
#define __DAL_RCM_I2C1_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_I2C1EN))
#define __DAL_RCM_I2C2_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_I2C2EN))
#define __DAL_RCM_PMU_CLK_SLEEP_ENABLE()     (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_PMUEN))

#define __DAL_RCM_TMR5_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR5EN))
#define __DAL_RCM_WWDT_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_WWDTEN))
#define __DAL_RCM_SPI2_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_SPI2EN))
#define __DAL_RCM_USART2_CLK_SLEEP_DISABLE() (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_USART2EN))
#define __DAL_RCM_I2C1_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_I2C1EN))
#define __DAL_RCM_I2C2_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_I2C2EN))
#define __DAL_RCM_PMU_CLK_SLEEP_DISABLE()    (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_PMUEN))
/**
  * @}
  */

/** @defgroup RCM_APB2_LowPower_Enable_Disable APB2 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wake-up from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_TMR1_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_TMR1EN))
#define __DAL_RCM_USART1_CLK_SLEEP_ENABLE()  (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_USART1EN))
#define __DAL_RCM_USART6_CLK_SLEEP_ENABLE()  (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_USART6EN))
#define __DAL_RCM_ADC1_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_ADC1EN))
#define __DAL_RCM_SPI1_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_SPI1EN))
#define __DAL_RCM_SYSCFG_CLK_SLEEP_ENABLE()  (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_SYSCFGEN))
#define __DAL_RCM_TMR9_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_TMR9EN))
#define __DAL_RCM_TMR11_CLK_SLEEP_ENABLE()   (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_TMR11EN))

#define __DAL_RCM_TMR1_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_TMR1EN))
#define __DAL_RCM_USART1_CLK_SLEEP_DISABLE() (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_USART1EN))
#define __DAL_RCM_USART6_CLK_SLEEP_DISABLE() (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_USART6EN))
#define __DAL_RCM_ADC1_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_ADC1EN))
#define __DAL_RCM_SPI1_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_SPI1EN))
#define __DAL_RCM_SYSCFG_CLK_SLEEP_DISABLE() (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_SYSCFGEN))
#define __DAL_RCM_TMR9_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_TMR9EN))
#define __DAL_RCM_TMR11_CLK_SLEEP_DISABLE()  (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_TMR11EN))
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

