betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
/** @defgroup RCM_HSI_Configuration HSI Configuration
  * @{
  */

/** @brief  Macros to enable or disable the Internal High Speed oscillator (HSI).
  * @note   The HSI is stopped by hardware when entering STOP and STANDBY modes.
  *         It is used (enabled by hardware) as system clock source after startup
  *         from Reset, wake-up from STOP and STANDBY mode, or in case of failure
  *         of the HSE used directly or indirectly as system clock (if the Clock
  *         Security System CSS is enabled).
  * @note   HSI can not be stopped if it is used as system clock source. In this case,
  *         you have to select another source of the system clock then stop the HSI.
  * @note   After enabling the HSI, the application software should wait on HSIRDY
  *         flag to be set indicating that HSI clock is stable and can be used as
  *         system clock source.
  *         This parameter can be: ENABLE or DISABLE.
  * @note   When the HSI is stopped, HSIRDY flag goes low after 6 HSI oscillator
  *         clock cycles.
  */
#define __DAL_RCM_HSI_ENABLE() (*(__IO uint32_t *) RCM_CTRL_HSIEN_BB = ENABLE)
#define __DAL_RCM_HSI_DISABLE() (*(__IO uint32_t *) RCM_CTRL_HSIEN_BB = DISABLE)

/** @brief  Macro to adjust the Internal High Speed oscillator (HSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __HSICalibrationValue__ specifies the calibration trimming value.
  *         (default is RCM_HSICALIBRATION_DEFAULT).
  *         This parameter must be a number between 0 and 0x1F.
  */
#define __DAL_RCM_HSI_CALIBRATIONVALUE_ADJUST(__HSICalibrationValue__) (MODIFY_REG(RCM->CTRL,\
        RCM_CTRL_HSITRM, (uint32_t)(__HSICalibrationValue__) << RCM_CTRL_HSITRM_Pos))
/**
  * @}
  */

/** @defgroup RCM_LSI_Configuration LSI Configuration
  * @{
  */

/** @brief  Macros to enable or disable the Internal Low Speed oscillator (LSI).
  * @note   After enabling the LSI, the application software should wait on
  *         LSIRDY flag to be set indicating that LSI clock is stable and can
  *         be used to clock the IWDT and/or the RTC.
  * @note   LSI can not be disabled if the IWDT is running.
  * @note   When the LSI is stopped, LSIRDY flag goes low after 6 LSI oscillator
  *         clock cycles.
  */
#define __DAL_RCM_LSI_ENABLE() (*(__IO uint32_t *) RCM_CSTS_LSIEN_BB = ENABLE)
#define __DAL_RCM_LSI_DISABLE() (*(__IO uint32_t *) RCM_CSTS_LSIEN_BB = DISABLE)
/**
  * @}
  */

/** @defgroup RCM_HSE_Configuration HSE Configuration
  * @{
  */

/**
  * @brief  Macro to configure the External High Speed oscillator (HSE).
  * @note   Transition HSE Bypass to HSE On and HSE On to HSE Bypass are not supported by this macro.
  *         User should request a transition to HSE Off first and then HSE On or HSE Bypass.
  * @note   After enabling the HSE (RCM_HSE_ON or RCM_HSE_Bypass), the application
  *         software should wait on HSERDY flag to be set indicating that HSE clock
  *         is stable and can be used to clock the PLL and/or system clock.
  * @note   HSE state can not be changed if it is used directly or through the
  *         PLL as system clock. In this case, you have to select another source
  *         of the system clock then change the HSE state (ex. disable it).
  * @note   The HSE is stopped by hardware when entering STOP and STANDBY modes.
  * @note   This function reset the CSSON bit, so if the clock security system(CSS)
  *         was previously enabled you have to enable it again after calling this
  *         function.
  * @param  __STATE__ specifies the new state of the HSE.
  *         This parameter can be one of the following values:
  *            @arg RCM_HSE_OFF: turn OFF the HSE oscillator, HSERDY flag goes low after
  *                              6 HSE oscillator clock cycles.
  *            @arg RCM_HSE_ON: turn ON the HSE oscillator.
  *            @arg RCM_HSE_BYPASS: HSE oscillator bypassed with external clock.
  */
#define __DAL_RCM_HSE_CONFIG(__STATE__)                         \
                    do {                                        \
                      if ((__STATE__) == RCM_HSE_ON)            \
                      {                                         \
                        SET_BIT(RCM->CTRL, RCM_CTRL_HSEEN);         \
                      }                                         \
                      else if ((__STATE__) == RCM_HSE_BYPASS)   \
                      {                                         \
                        SET_BIT(RCM->CTRL, RCM_CTRL_HSEBCFG);        \
                        SET_BIT(RCM->CTRL, RCM_CTRL_HSEEN);         \
                      }                                         \
                      else                                      \
                      {                                         \
                        CLEAR_BIT(RCM->CTRL, RCM_CTRL_HSEEN);       \
                        CLEAR_BIT(RCM->CTRL, RCM_CTRL_HSEBCFG);      \
                      }                                         \
                    } while(0U)
/**
  * @}
  */

/** @defgroup RCM_LSE_Configuration LSE Configuration
  * @{
  */

/**
  * @brief  Macro to configure the External Low Speed oscillator (LSE).
  * @note   Transition LSE Bypass to LSE On and LSE On to LSE Bypass are not supported by this macro.
  *         User should request a transition to LSE Off first and then LSE On or LSE Bypass.
  * @note   As the LSE is in the Backup domain and write access is denied to
  *         this domain after reset, you have to enable write access using
  *         DAL_PMU_EnableBkUpAccess() function before to configure the LSE
  *         (to be done once after reset).
  * @note   After enabling the LSE (RCM_LSE_ON or RCM_LSE_BYPASS), the application
  *         software should wait on LSERDY flag to be set indicating that LSE clock
  *         is stable and can be used to clock the RTC.
  * @param  __STATE__ specifies the new state of the LSE.
  *         This parameter can be one of the following values:
  *            @arg RCM_LSE_OFF: turn OFF the LSE oscillator, LSERDY flag goes low after
  *                              6 LSE oscillator clock cycles.
  *            @arg RCM_LSE_ON: turn ON the LSE oscillator.
  *            @arg RCM_LSE_BYPASS: LSE oscillator bypassed with external clock.
  */
#define __DAL_RCM_LSE_CONFIG(__STATE__) \
                    do {                                       \
                      if((__STATE__) == RCM_LSE_ON)            \
                      {                                        \
                        SET_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEEN);    \
                      }                                        \
                      else if((__STATE__) == RCM_LSE_BYPASS)   \
                      {                                        \
                        SET_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEBCFG);   \
                        SET_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEEN);    \
                      }                                        \
                      else                                     \
                      {                                        \
                        CLEAR_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEEN);  \
                        CLEAR_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEBCFG); \
                      }                                        \
                    } while(0U)
/**
  * @}
  */

/** @defgroup RCM_Internal_RTC_Clock_Configuration RTC Clock Configuration
  * @{
  */

/** @brief  Macros to enable or disable the RTC clock.
  * @note   These macros must be used only after the RTC clock source was selected.
  */
#define __DAL_RCM_RTC_ENABLE() (*(__IO uint32_t *) RCM_BDCTRL_RTCCLKEN_BB = ENABLE)
#define __DAL_RCM_RTC_DISABLE() (*(__IO uint32_t *) RCM_BDCTRL_RTCCLKEN_BB = DISABLE)

