betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @brief  Macros to configure the RTC clock (RTCCLK).
  * @note   As the RTC clock configuration bits are in the Backup domain and write
  *         access is denied to this domain after reset, you have to enable write
  *         access using the Power Backup Access macro before to configure
  *         the RTC clock source (to be done once after reset).
  * @note   Once the RTC clock is configured it can't be changed unless the
  *         Backup domain is reset using __DAL_RCM_BackupReset_RELEASE() macro, or by
  *         a Power On Reset (POR).
  * @param  __RTCCLKSource__ specifies the RTC clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCM_RTCCLKSOURCE_NO_CLK : No clock selected as RTC clock.
  *            @arg @ref RCM_RTCCLKSOURCE_LSE : LSE selected as RTC clock.
  *            @arg @ref RCM_RTCCLKSOURCE_LSI : LSI selected as RTC clock.
  *            @arg @ref RCM_RTCCLKSOURCE_HSE_DIVX HSE divided by X selected as RTC clock (X can be retrieved thanks to @ref __DAL_RCM_GET_RTC_HSE_PRESCALER()
  * @note   If the LSE or LSI is used as RTC clock source, the RTC continues to
  *         work in STOP and STANDBY modes, and can be used as wake-up source.
  *         However, when the HSE clock is used as RTC clock source, the RTC
  *         cannot be used in STOP and STANDBY modes.
  * @note   The maximum input clock frequency for RTC is 1MHz (when using HSE as
  *         RTC clock source).
  */
#define __DAL_RCM_RTC_CLKPRESCALER(__RTCCLKSource__) (((__RTCCLKSource__) & RCM_BDCTRL_RTCSRCSEL) == RCM_BDCTRL_RTCSRCSEL) ?    \
                                                 MODIFY_REG(RCM->CFG, RCM_CFG_RTCPSC, ((__RTCCLKSource__) & 0xFFFFCFFU)) : CLEAR_BIT(RCM->CFG, RCM_CFG_RTCPSC)

#define __DAL_RCM_RTC_CONFIG(__RTCCLKSource__) do { __DAL_RCM_RTC_CLKPRESCALER(__RTCCLKSource__);    \
                                                    RCM->BDCTRL |= ((__RTCCLKSource__) & 0x00000FFFU);  \
                                                   } while(0U)

/**
  * @brief   Get the RTC and HSE clock divider (RTCPRE).
  * @retval Returned value can be one of the following values:
 *            @arg @ref RCM_RTCCLKSOURCE_HSE_DIVX HSE divided by X selected as RTC clock (X can be retrieved thanks to @ref __DAL_RCM_GET_RTC_HSE_PRESCALER()
  */
#define  __DAL_RCM_GET_RTC_HSE_PRESCALER() (READ_BIT(RCM->CFG, RCM_CFG_RTCPSC) | RCM_BDCTRL_RTCSRCSEL)

#else

/** @brief Macro to get the RTC clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCM_RTCCLKSOURCE_NO_CLK : No clock selected as RTC clock.
  *            @arg @ref RCM_RTCCLKSOURCE_LSE : LSE selected as RTC clock.
  *            @arg @ref RCM_RTCCLKSOURCE_LSI : LSI selected as RTC clock.
  *            @arg @ref RCM_RTCCLKSOURCE_HSE_DIV128 : HSE divided by 128 selected as RTC clock
  */
#define __DAL_RCM_RTC_CONFIG(__RTC_CLKSOURCE__)  (MODIFY_REG(RCM->BDCTRL, RCM_BDCTRL_RTCSRCSEL, (__RTC_CLKSOURCE__)))

#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/** @brief Macro to get the RTC clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCM_RTCCLKSOURCE_NO_CLK No clock selected as RTC clock
  *            @arg @ref RCM_RTCCLKSOURCE_LSE LSE selected as RTC clock
  *            @arg @ref RCM_RTCCLKSOURCE_LSI LSI selected as RTC clock
  *            @arg @ref RCM_RTCCLKSOURCE_HSE_DIVX HSE divided by X selected as RTC clock (X can be retrieved thanks to @ref __DAL_RCM_GET_RTC_HSE_PRESCALER()
  */
#define __DAL_RCM_GET_RTC_SOURCE() (READ_BIT(RCM->BDCTRL, RCM_BDCTRL_RTCSRCSEL))

/** @brief  Macros to force or release the Backup domain reset.
  * @note   This function resets the RTC peripheral (including the backup registers)
  *         and the RTC clock source selection in RCM_CSTS register.
  * @note   The BKPSRAM is not affected by this reset.
  */
#define __DAL_RCM_BACKUPRESET_FORCE() (*(__IO uint32_t *) RCM_BDCTRL_BDRST_BB = ENABLE)
#define __DAL_RCM_BACKUPRESET_RELEASE() (*(__IO uint32_t *) RCM_BDCTRL_BDRST_BB = DISABLE)
/**
  * @}
  */

/** @defgroup RCM_PLL_Configuration PLL Configuration
  * @{
  */

/** @brief  Macros to enable or disable the main PLL.
  * @note   After enabling the main PLL, the application software should wait on
  *         PLLRDY flag to be set indicating that PLL clock is stable and can
  *         be used as system clock source.
  * @note   The main PLL can not be disabled if it is used as system clock source
  * @note   The main PLL is disabled by hardware when entering STOP and STANDBY modes.
  */
#define __DAL_RCM_PLL_ENABLE() (*(__IO uint32_t *) RCM_CTRL_PLL1EN_BB = ENABLE)
#define __DAL_RCM_PLL_DISABLE() (*(__IO uint32_t *) RCM_CTRL_PLL1EN_BB = DISABLE)

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @brief  Macro to configure the PLL clock source.
  * @note   This function must be used only when the main PLL is disabled.
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *         This parameter can be one of the following values:
  *            @arg RCM_PLLSOURCE_HSI: HSI oscillator clock selected as PLL clock entry
  *            @arg RCM_PLLSOURCE_HSE: HSE oscillator clock selected as PLL clock entry
  *
  */
#define __DAL_RCM_PLL_PLLSOURCE_CONFIG(__PLLSOURCE__) MODIFY_REG(RCM->PLL1CFG, RCM_PLL1CFG_PLL1CLKS, (__PLLSOURCE__))

/** @brief  Macro to configure the PLL multiplication factor.
  * @note   This function must be used only when the main PLL is disabled.
  * @param  __PLLB__ specifies the division factor for PLL VCO input clock
  *         This parameter must be a number between Min_Data = 2 and Max_Data = 63.
  * @note   You have to set the PLLB parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 2 MHz. It is recommended to select a frequency
  *         of 2 MHz to limit PLL jitter.
  *
  */
#define __DAL_RCM_PLL_PLLB_CONFIG(__PLLB__) MODIFY_REG(RCM->PLL1CFG, RCM_PLL1CFG_PLLB, (__PLLB__))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCM_Get_Clock_source Get Clock source
  * @{
  */
/**
  * @brief Macro to configure the system clock source.
  * @param __RCM_SYSCLKSOURCE__ specifies the system clock source.
  * This parameter can be one of the following values:
  *              - RCM_SYSCLKSOURCE_HSI: HSI oscillator is used as system clock source.
  *              - RCM_SYSCLKSOURCE_HSE: HSE oscillator is used as system clock source.
  *              - RCM_SYSCLKSOURCE_PLLCLK: PLL output is used as system clock source.
  */
#define __DAL_RCM_SYSCLK_CONFIG(__RCM_SYSCLKSOURCE__) MODIFY_REG(RCM->CFG, RCM_CFG_SCLKSEL, (__RCM_SYSCLKSOURCE__))

/** @brief  Macro to get the clock source used as system clock.
  * @retval The clock source used as system clock. The returned value can be one
  *         of the following:
  *              - RCM_SYSCLKSOURCE_STATUS_HSI: HSI used as system clock.
  *              - RCM_SYSCLKSOURCE_STATUS_HSE: HSE used as system clock.
  *              - RCM_SYSCLKSOURCE_STATUS_PLLCLK: PLL used as system clock.
  */
#define __DAL_RCM_GET_SYSCLK_SOURCE() (RCM->CFG & RCM_CFG_SCLKSELSTS)

