betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @brief  Macro to get the oscillator used as PLL clock source.
  * @retval The oscillator used as PLL clock source. The returned value can be one
  *         of the following:
  *              - RCM_PLLSOURCE_HSI: HSI oscillator is used as PLL clock source.
  *              - RCM_PLLSOURCE_HSE: HSE oscillator is used as PLL clock source.
  */
#define __DAL_RCM_GET_PLL_OSCSOURCE() ((uint32_t)(RCM->PLL1CFG & RCM_PLL1CFG_PLL1CLKS))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCMEx_MCOx_Clock_Config RCM Extended MCOx Clock Config
  * @{
  */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @brief  Macro to configure the MCO1 clock.
  * @param  __MCOCLKSOURCE__ specifies the MCO clock source.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCO1SOURCE_HSI: HSI clock selected as MCO1 source
  *            @arg RCM_MCO1SOURCE_LSE: LSE clock selected as MCO1 source
  *            @arg RCM_MCO1SOURCE_HSE: HSE clock selected as MCO1 source
  *            @arg RCM_MCO1SOURCE_PLLCLK: main PLL clock selected as MCO1 source
  * @param  __MCODIV__ specifies the MCO clock prescaler.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCODIV_1: no division applied to MCOx clock
  *            @arg RCM_MCODIV_2: division by 2 applied to MCOx clock
  *            @arg RCM_MCODIV_3: division by 3 applied to MCOx clock
  *            @arg RCM_MCODIV_4: division by 4 applied to MCOx clock
  *            @arg RCM_MCODIV_5: division by 5 applied to MCOx clock
  */
#define __DAL_RCM_MCO1_CONFIG(__MCOCLKSOURCE__, __MCODIV__) \
                 MODIFY_REG(RCM->CFG, (RCM_CFG_MCO1SEL | RCM_CFG_MCO1PSC), ((__MCOCLKSOURCE__) | (__MCODIV__)))

/** @brief  Macro to configure the MCO2 clock.
  * @param  __MCOCLKSOURCE__ specifies the MCO clock source.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCO2SOURCE_SYSCLK: System clock (SYSCLK) selected as MCO2 source
  *            @arg RCM_MCO2SOURCE_PLLI2SCLK: PLLI2S clock selected as MCO2 source (*)
  *            @arg RCM_MCO2SOURCE_HSE: HSE clock selected as MCO2 source
  *            @arg RCM_MCO2SOURCE_PLLCLK: main PLL clock selected as MCO2 source
  * @param  __MCODIV__ specifies the MCO clock prescaler.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCODIV_1: no division applied to MCOx clock
  *            @arg RCM_MCODIV_2: division by 2 applied to MCOx clock
  *            @arg RCM_MCODIV_3: division by 3 applied to MCOx clock
  *            @arg RCM_MCODIV_4: division by 4 applied to MCOx clock
  *            @arg RCM_MCODIV_5: division by 5 applied to MCOx clock
  */
#define __DAL_RCM_MCO2_CONFIG(__MCOCLKSOURCE__, __MCODIV__) \
    MODIFY_REG(RCM->CFG, (RCM_CFG_MCO2SEL | RCM_CFG_MCO2PSC), ((__MCOCLKSOURCE__) | ((__MCODIV__) << 3U)));
#else

/** @brief  Macro to configure the MCO clock.
  * @param  __MCOCLKSOURCE__ specifies the MCO clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCM_MCO1SOURCE_NOCLOCK No clock selected as MCO clock
  *            @arg @ref RCM_MCO1SOURCE_SYSCLK  System clock (SYSCLK) selected as MCO clock
  *            @arg @ref RCM_MCO1SOURCE_HSI HSI selected as MCO clock
  *            @arg @ref RCM_MCO1SOURCE_HSE HSE selected as MCO clock
  *            @arg @ref RCM_MCO1SOURCE_PLLCLK  PLL clock divided by 2 selected as MCO clock
  * @param  __MCODIV__ specifies the MCO clock prescaler.
  *         This parameter can be one of the following values:
  *            @arg @ref RCM_MCODIV_1 No division applied on MCO clock source
  */
#define __DAL_RCM_MCO1_CONFIG(__MCOCLKSOURCE__, __MCODIV__) \
                 MODIFY_REG(RCM->CFG, RCM_CFG_MCOSEL, (__MCOCLKSOURCE__))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCM_Flags_Interrupts_Management Flags Interrupts Management
  * @brief macros to manage the specified RCM Flags and interrupts.
  * @{
  */

/** @brief  Enable RCM interrupt (Perform Byte access to RCM_INT[14:8] bits to enable
  *         the selected interrupts).
  * @param  __INTERRUPT__ specifies the RCM interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCM_IT_LSIRDY: LSI ready interrupt.
  *            @arg RCM_IT_LSERDY: LSE ready interrupt.
  *            @arg RCM_IT_HSIRDY: HSI ready interrupt.
  *            @arg RCM_IT_HSERDY: HSE ready interrupt.
  *            @arg RCM_IT_PLLRDY: Main PLL ready interrupt.
  *            @arg RCM_IT_PLL2RDY: PLLI2S ready interrupt. (*)
  */
#define __DAL_RCM_ENABLE_IT(__INTERRUPT__) (*(__IO uint8_t *) RCM_INT_BYTE1_ADDRESS |= (__INTERRUPT__))

/** @brief Disable RCM interrupt (Perform Byte access to RCM_INT[14:8] bits to disable
  *        the selected interrupts).
  * @param  __INTERRUPT__ specifies the RCM interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCM_IT_LSIRDY: LSI ready interrupt.
  *            @arg RCM_IT_LSERDY: LSE ready interrupt.
  *            @arg RCM_IT_HSIRDY: HSI ready interrupt.
  *            @arg RCM_IT_HSERDY: HSE ready interrupt.
  *            @arg RCM_IT_PLLRDY: Main PLL ready interrupt.
  *            @arg RCM_IT_PLL2RDY: PLLI2S ready interrupt. (*)
  */
#define __DAL_RCM_DISABLE_IT(__INTERRUPT__) (*(__IO uint8_t *) RCM_INT_BYTE1_ADDRESS &= (uint8_t)(~(__INTERRUPT__)))

