betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
/** @brief  Clear the RCM's interrupt pending bits (Perform Byte access to RCM_INT[23:16]
  *         bits to clear the selected interrupt pending bits.
  * @param  __INTERRUPT__ specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *            @arg RCM_IT_LSIRDY: LSI ready interrupt.
  *            @arg RCM_IT_LSERDY: LSE ready interrupt.
  *            @arg RCM_IT_HSIRDY: HSI ready interrupt.
  *            @arg RCM_IT_HSERDY: HSE ready interrupt.
  *            @arg RCM_IT_PLLRDY: Main PLL ready interrupt.
  *            @arg RCM_IT_PLL2RDY: PLLI2S ready interrupt. (*)
  *            @arg RCM_IT_CSS: Clock Security System interrupt.
  */
#define __DAL_RCM_CLEAR_IT(__INTERRUPT__) (*(__IO uint8_t *) RCM_INT_BYTE2_ADDRESS = (__INTERRUPT__))

/** @brief  Check the RCM's interrupt has occurred or not.
  * @param  __INTERRUPT__ specifies the RCM interrupt source to check.
  *         This parameter can be one of the following values:
  *            @arg RCM_IT_LSIRDY: LSI ready interrupt.
  *            @arg RCM_IT_LSERDY: LSE ready interrupt.
  *            @arg RCM_IT_HSIRDY: HSI ready interrupt.
  *            @arg RCM_IT_HSERDY: HSE ready interrupt.
  *            @arg RCM_IT_PLLRDY: Main PLL ready interrupt.
  *            @arg RCM_IT_PLL2RDY: PLLI2S ready interrupt. (*)
  *            @arg RCM_IT_CSS: Clock Security System interrupt

  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#define __DAL_RCM_GET_IT(__INTERRUPT__) ((RCM->INT & (__INTERRUPT__)) == (__INTERRUPT__))

/** @brief Set RMVF bit to clear the reset flags: RCM_FLAG_PINRST, RCM_FLAG_PORRST,
  *        RCM_FLAG_SFTRST, RCM_FLAG_IWDTRST, RCM_FLAG_WWDTRST and RCM_FLAG_LPWRRST.
  */
#define __DAL_RCM_CLEAR_RESET_FLAGS() (RCM->CSTS |= RCM_CSTS_RSTFLGCLR)

/** @brief  Check RCM flag is set or not.
  * @param  __FLAG__ specifies the flag to check.
  *         This parameter can be one of the following values:
  *            @arg RCM_FLAG_HSIRDY: HSI oscillator clock ready.
  *            @arg RCM_FLAG_HSERDY: HSE oscillator clock ready.
  *            @arg RCM_FLAG_PLLRDY: Main PLL clock ready.
  *            @arg RCM_FLAG_PLL2RDY: PLLI2S clock ready.  (*)
  *            @arg RCM_FLAG_LSERDY: LSE oscillator clock ready.
  *            @arg RCM_FLAG_LSIRDY: LSI oscillator clock ready.
  *            @arg RCM_FLAG_BORRST: POR/PDR or BOR reset. (*)
  *            @arg RCM_FLAG_PINRST: Pin reset.
  *            @arg RCM_FLAG_PORRST: POR/PDR reset.
  *            @arg RCM_FLAG_SFTRST: Software reset.
  *            @arg RCM_FLAG_IWDTRST: Independent Watchdog reset.
  *            @arg RCM_FLAG_WWDTRST: Window Watchdog reset.
  *            @arg RCM_FLAG_LPWRRST: Low Power reset.
  *            (*)This parameter is not available for APM32F402/403xx device.
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define RCM_FLAG_MASK  ((uint8_t)0x1FU)
#define __DAL_RCM_GET_FLAG(__FLAG__) (((((((__FLAG__) >> 5U) == 1U)? RCM->CTRL : \
                                        ((((__FLAG__) >> 5U) == 2U)? RCM->BDCTRL : \
                                        ((((__FLAG__) >> 5U) == 3U)? RCM->CSTS : \
                                                       RCM->INT))) & (1U << ((__FLAG__) & RCM_FLAG_MASK)))!= 0U)? 1U : 0U)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
 /** @addtogroup RCM_Exported_Functions
  * @{
  */

/** @addtogroup RCM_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions  ******************************/
DAL_StatusTypeDef DAL_RCM_DeInit(void);
DAL_StatusTypeDef DAL_RCM_OscConfig(RCM_OscInitTypeDef *RCM_OscInitStruct);
DAL_StatusTypeDef DAL_RCM_ClockConfig(RCM_ClkInitTypeDef *RCM_ClkInitStruct, uint32_t FLatency);
/**
  * @}
  */

/** @addtogroup RCM_Exported_Functions_Group2
  * @{
  */
/* Peripheral Control functions  ************************************************/
void     DAL_RCM_MCOConfig(uint32_t RCM_MCOx, uint32_t RCM_MCOSource, uint32_t RCM_MCODiv);
void     DAL_RCM_EnableCSS(void);
void     DAL_RCM_DisableCSS(void);
uint32_t DAL_RCM_GetSysClockFreq(void);
uint32_t DAL_RCM_GetHCLKFreq(void);
uint32_t DAL_RCM_GetPCLK1Freq(void);
uint32_t DAL_RCM_GetPCLK2Freq(void);
void     DAL_RCM_GetOscConfig(RCM_OscInitTypeDef *RCM_OscInitStruct);
void     DAL_RCM_GetClockConfig(RCM_ClkInitTypeDef *RCM_ClkInitStruct, uint32_t *pFLatency);

/* CSS NMI IRQ handler */
void DAL_RCM_NMI_IRQHandler(void);

/* User Callbacks in non blocking mode (IT mode) */
void DAL_RCM_CSSCallback(void);

/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup RCM_Private_Constants RCM Private Constants
  * @{
  */

/** @defgroup RCM_BitAddress_AliasRegion RCM BitAddress AliasRegion
  * @brief RCM registers bit address in the alias region
  * @{
  */
#define RCM_OFFSET                  (RCM_BASE - PERIPH_BASE)
/* --- CTRL Register --- */
/* Alias word address of HSIEN bit */
#define RCM_CTRL_OFFSET             (RCM_OFFSET + 0x00U)
#define RCM_HSIEN_BIT_NUMBER        0x00U
#define RCM_CTRL_HSIEN_BB           (PERIPH_BB_BASE + (RCM_CTRL_OFFSET * 32U) + (RCM_HSIEN_BIT_NUMBER * 4U))
/* Alias word address of CSSEN bit */
#define RCM_CSSEN_BIT_NUMBER        0x13U
#define RCM_CTRL_CSSEN_BB           (PERIPH_BB_BASE + (RCM_CTRL_OFFSET * 32U) + (RCM_CSSEN_BIT_NUMBER * 4U))
/* Alias word address of PLL1EN bit */
#define RCM_PLLEN_BIT_NUMBER        0x18U
#define RCM_CTRL_PLL1EN_BB          (PERIPH_BB_BASE + (RCM_CTRL_OFFSET * 32U) + (RCM_PLLEN_BIT_NUMBER * 4U))

/* --- BDCTRL Register --- */
/* Alias word address of RTCEN bit */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define RCM_BDCTRL_OFFSET           (RCM_OFFSET + 0x20U)
#else
#define RCM_BDCTRL_OFFSET           (RCM_OFFSET + 0x70U)
#endif /* APM32F403xx || APM32F402xx */
#define RCM_RTCEN_BIT_NUMBER        0x0FU
#define RCM_BDCTRL_RTCCLKEN_BB      (PERIPH_BB_BASE + (RCM_BDCTRL_OFFSET * 32U) + (RCM_RTCEN_BIT_NUMBER * 4U))
/* Alias word address of BDRST bit */
#define RCM_BDRST_BIT_NUMBER        0x10U
#define RCM_BDCTRL_BDRST_BB         (PERIPH_BB_BASE + (RCM_BDCTRL_OFFSET * 32U) + (RCM_BDRST_BIT_NUMBER * 4U))

/* --- CSTS Register --- */
/* Alias word address of LSION bit */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define RCM_CSTS_OFFSET             (RCM_OFFSET + 0x24U)
#else
#define RCM_CSTS_OFFSET             (RCM_OFFSET + 0x74U)
#endif /* APM32F403xx || APM32F402xx */
#define RCM_LSIEN_BIT_NUMBER        0x00U
#define RCM_CSTS_LSIEN_BB           (PERIPH_BB_BASE + (RCM_CSTS_OFFSET * 32U) + (RCM_LSIEN_BIT_NUMBER * 4U))

