betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
/* CTRL register byte 3 (Bits[23:16]) base address */
#define RCM_CTRL_BYTE2_ADDRESS       0x40023802U

#if defined(APM32F403xx) || defined(APM32F402xx)
/* INT register byte 2 (Bits[15:8]) base address */
#define RCM_INT_BYTE1_ADDRESS      ((uint32_t)(RCM_BASE + 0x08U + 0x01U))

/* INT register byte 3 (Bits[23:16]) base address */
#define RCM_INT_BYTE2_ADDRESS      ((uint32_t)(RCM_BASE + 0x08U + 0x02U))
#else
/* INT register byte 2 (Bits[15:8]) base address */
#define RCM_INT_BYTE1_ADDRESS      ((uint32_t)(RCM_BASE + 0x0CU + 0x01U))

/* INT register byte 3 (Bits[23:16]) base address */
#define RCM_INT_BYTE2_ADDRESS      ((uint32_t)(RCM_BASE + 0x0CU + 0x02U))
#endif /* APM32F403xx || APM32F402xx */

/* BDCTRL register base address */
#define RCM_BDCTRL_BYTE0_ADDRESS     (PERIPH_BASE + RCM_BDCTRL_OFFSET)

#define RCM_DBP_TIMEOUT_VALUE      2U
#define RCM_LSE_TIMEOUT_VALUE      LSE_STARTUP_TIMEOUT

#define HSE_TIMEOUT_VALUE          HSE_STARTUP_TIMEOUT
#define HSI_TIMEOUT_VALUE          2U  /* 2 ms */
#define LSI_TIMEOUT_VALUE          2U  /* 2 ms */
#define CLOCKSWITCH_TIMEOUT_VALUE  5000U /* 5 s */

/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup RCM_Private_Macros RCM Private Macros
  * @{
  */

/** @defgroup RCM_IS_RCM_Definitions RCM Private macros to check input parameters
  * @{
  */
#define IS_RCM_OSCILLATORTYPE(OSCILLATOR) ((OSCILLATOR) <= 15U)

#define IS_RCM_HSE(HSE) (((HSE) == RCM_HSE_OFF) || ((HSE) == RCM_HSE_ON) || \
                         ((HSE) == RCM_HSE_BYPASS))

#define IS_RCM_LSE(LSE) (((LSE) == RCM_LSE_OFF) || ((LSE) == RCM_LSE_ON) || \
                         ((LSE) == RCM_LSE_BYPASS))

#define IS_RCM_HSI(HSI) (((HSI) == RCM_HSI_OFF) || ((HSI) == RCM_HSI_ON))

#define IS_RCM_LSI(LSI) (((LSI) == RCM_LSI_OFF) || ((LSI) == RCM_LSI_ON))

#define IS_RCM_PLL(PLL) (((PLL) == RCM_PLL_NONE) ||((PLL) == RCM_PLL_OFF) || ((PLL) == RCM_PLL_ON))

#if defined (APM32F403xx) || defined (APM32F402xx)
#define IS_RCM_PLLSOURCE(SOURCE) (((SOURCE) == RCM_PLLSOURCE_HSI_DIV2) || \
                                  ((SOURCE) == RCM_PLLSOURCE_HSE))
#else
#define IS_RCM_PLLSOURCE(SOURCE) (((SOURCE) == RCM_PLLSOURCE_HSI) || \
                                  ((SOURCE) == RCM_PLLSOURCE_HSE))
#endif /* APM32F403xx || APM32F402xx */

#define IS_RCM_SYSCLKSOURCE(SOURCE) (((SOURCE) == RCM_SYSCLKSOURCE_HSI) || \
                                     ((SOURCE) == RCM_SYSCLKSOURCE_HSE) || \
                                     ((SOURCE) == RCM_SYSCLKSOURCE_PLLCLK))

#if defined(APM32F403xx) || defined(APM32F402xx)
#define IS_RCM_RTCCLKSOURCE(__SOURCE__) (((__SOURCE__) == RCM_RTCCLKSOURCE_NO_CLK) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_LSE) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_LSI) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV128))
#else
#define IS_RCM_RTCCLKSOURCE(__SOURCE__) (((__SOURCE__) == RCM_RTCCLKSOURCE_LSE) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_LSI) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV2) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV3) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV4) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV5) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV6) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV7) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV8) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV9) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV10) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV11) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV12) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV13) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV14) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV15) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV16) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV17) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV18) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV19) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV20) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV21) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV22) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV23) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV24) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV25) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV26) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV27) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV28) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV29) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV30) || \
                                         ((__SOURCE__) == RCM_RTCCLKSOURCE_HSE_DIV31))
#endif /* APM32F403xx || APM32F402xx */

#define IS_RCM_PLLB_VALUE(VALUE) ((VALUE) <= 63U)

#define IS_RCM_PLL1C_VALUE(VALUE) (((VALUE) == 2U) || ((VALUE) == 4U) || ((VALUE) == 6U) || ((VALUE) == 8U))

#define IS_RCM_PLLD_VALUE(VALUE) ((2U <= (VALUE)) && ((VALUE) <= 15U))

#define IS_RCM_PLL_MUL(__MUL__) (((__MUL__) == RCM_PLL_MUL2)  || ((__MUL__) == RCM_PLL_MUL3)  || \
                                 ((__MUL__) == RCM_PLL_MUL4)  || ((__MUL__) == RCM_PLL_MUL5)  || \
                                 ((__MUL__) == RCM_PLL_MUL6)  || ((__MUL__) == RCM_PLL_MUL7)  || \
                                 ((__MUL__) == RCM_PLL_MUL8)  || ((__MUL__) == RCM_PLL_MUL9)  || \
                                 ((__MUL__) == RCM_PLL_MUL10) || ((__MUL__) == RCM_PLL_MUL11) || \
                                 ((__MUL__) == RCM_PLL_MUL12) || ((__MUL__) == RCM_PLL_MUL13) || \
                                 ((__MUL__) == RCM_PLL_MUL14) || ((__MUL__) == RCM_PLL_MUL15) || \
                                 ((__MUL__) == RCM_PLL_MUL16))

#define IS_RCM_HCLK(HCLK) (((HCLK) == RCM_SYSCLK_DIV1)   || ((HCLK) == RCM_SYSCLK_DIV2)   || \
                           ((HCLK) == RCM_SYSCLK_DIV4)   || ((HCLK) == RCM_SYSCLK_DIV8)   || \
                           ((HCLK) == RCM_SYSCLK_DIV16)  || ((HCLK) == RCM_SYSCLK_DIV64)  || \
                           ((HCLK) == RCM_SYSCLK_DIV128) || ((HCLK) == RCM_SYSCLK_DIV256) || \
                           ((HCLK) == RCM_SYSCLK_DIV512))

