betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm.h
#define IS_RCM_CLOCKTYPE(CLK) ((1U <= (CLK)) && ((CLK) <= 15U))

#define IS_RCM_PCLK(PCLK) (((PCLK) == RCM_HCLK_DIV1) || ((PCLK) == RCM_HCLK_DIV2) || \
                           ((PCLK) == RCM_HCLK_DIV4) || ((PCLK) == RCM_HCLK_DIV8) || \
                           ((PCLK) == RCM_HCLK_DIV16))

#define IS_RCM_MCO(MCOx) (((MCOx) == RCM_MCO1) || ((MCOx) == RCM_MCO2))

#if defined(APM32F403xx) || defined(APM32F402xx)
#define IS_RCM_MCO1SOURCE(__SOURCE__) (((__SOURCE__) == RCM_MCO1SOURCE_SYSCLK)  || ((__SOURCE__) == RCM_MCO1SOURCE_HSI) \
                                    || ((__SOURCE__) == RCM_MCO1SOURCE_HSE)     || ((__SOURCE__) == RCM_MCO1SOURCE_PLLCLK) \
                                    || ((__SOURCE__) == RCM_MCO1SOURCE_NOCLOCK))
#else
#define IS_RCM_MCO1SOURCE(SOURCE) (((SOURCE) == RCM_MCO1SOURCE_HSI) || ((SOURCE) == RCM_MCO1SOURCE_LSE) || \
                                   ((SOURCE) == RCM_MCO1SOURCE_HSE) || ((SOURCE) == RCM_MCO1SOURCE_PLLCLK))
#endif /* APM32F403xx || APM32F402xx */

#if defined(APM32F403xx) || defined(APM32F402xx)
#define IS_RCM_MCODIV(DIV) ((DIV) == RCM_MCODIV_1)
#else
#define IS_RCM_MCODIV(DIV) (((DIV) == RCM_MCODIV_1)  || ((DIV) == RCM_MCODIV_2) || \
                             ((DIV) == RCM_MCODIV_3) || ((DIV) == RCM_MCODIV_4) || \
                             ((DIV) == RCM_MCODIV_5))
#endif /* APM32F403xx || APM32F402xx */
#define IS_RCM_CALIBRATION_VALUE(VALUE) ((VALUE) <= 0x1FU)

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DAL_RCM_H */

